
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
	//++Черкашина С.А.
	Для Каждого ТекущиеДанные Из Товары Цикл
		
		ПередЗаписьюПроверкаСтрокТЧ(Отказ, ТекущиеДанные);
		
	КонецЦикла;
	
	Для Каждого ТекущиеДанные Из Услуги Цикл
		
		ПередЗаписьюПроверкаСтрокТЧ(Отказ, ТекущиеДанные);
		
	КонецЦикла;
	//--
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ЗадолженностьПокупателей.Записывать = Истина;
	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Движение = Движения.ЗадолженностьПокупателей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Сумма = СуммаДокумента;

	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Заказ = Ссылка;
	Движение.Договор = Договор;
	Движение.СуммаЗаказа = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		
	КонецЦикла;

	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаУслуги.Номенклатура;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ДЗ_Доработки

Процедура ПередЗаписьюПроверкаСтрокТЧ(Отказ, ТекущиеДанные)
	
	СуммарнаяСкидка = ТекущиеДанные.Скидка + СогласованнаяСкидка;
	
	Если СуммарнаяСкидка > 100 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неверно указан размер скидки. Суммарная скидка не может превышать 100%."; 
		Сообщение.УстановитьДанные(ЭтотОбъект);		
		Сообщение.Сообщить();
		
		Отказ = Истина;		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
